app/controllers/game_controller.rb

SELECT "games".* FROM "games" WHERE (player1_id IS NULL OR player2_id IS NULL) LIMIT 1
UPDATE "games" SET "updated_at" = '2010-12-16 06:18:59.615282', "player2_id" = 2 WHERE ("games"."id" = 1)
INSERT INTO "game_boards" ("y", "updated_at", "x", "game_id", "created_at") VALUES (75, '2010-12-16 06:31:07.681024', 75, 2, '2010-12-16 06:31:07.681024')
INSERT INTO "games" ("turns_remaining", "player2_id", "ready", "updated_at", "player1_id", "game_board_id", "created_at") VALUES (NULL, NULL, NULL, '2010-12-16 04:36:05.163131', NULL, NULL, '2010-12-16 04:36:05.163131')
INSERT INTO "players" ("y", "money", "turns_remaining", "can_act", "prev_x", "x", "kills", "chocolate", "uuid", "can_move", "sales", "strawberry", "game_id", "turn", "prev_y", "vanilla", "updated_at", "created_at") VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'QCVHXVKHORTKUSJO', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-12-16 03:34:42.621639', '2010-12-16 03:34:42.621639')
INSERT INTO "tiles" ("y", "store", "x", "zombies", "updated_at", "created_at", "game_board_id") VALUES (37, 't', 37, NULL, '2010-12-19 17:24:43.975392', '2010-12-19 17:24:43.975392', NULL)
UPDATE "players" SET "can_move" = 't', "updated_at" = '2010-12-19 17:38:07.048630' WHERE ("players"."id" = 1)
UPDATE "tiles" SET "updated_at" = '2010-12-19 17:24:43.977837', "game_board_id" = 1 WHERE ("tiles"."id" = 1)
---
  def join
    g = Game.waiting.first()
    g = Game.new_with_game_board if !g
    g.save!
    @p = Player.new(:name => params[:name])
    @p.setup(g.game_board.initial_tile)
    @p.save!
    g.add_player!(@p)
    g.start_game if g.ready?
    g.save!

SELECT "players".* FROM "players" WHERE ("players"."uuid" IS NULL) LIMIT 1
---
  def get_game_state
    @player = Player.find_by_uuid(params[:uuid])

SELECT "players".* FROM "players" WHERE ("players"."uuid" = 'LRQFSNUCQPUNXFVC') LIMIT 1
---
  def post_make_move
    #moves to a new tile : if tile doesn't exist, create the tile and add it to the game_state
    @player = Player.find_by_uuid(params[:uuid])